In [14]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
s = pd.Series([1,3,5,np.nan,6,8,1])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
6    1.0
dtype: float64

In [15]:

dates = pd.date_range('20130101', periods=5)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df = pd.DataFrame(np.random.randn(5,5), index=dates, columns=list('ABCDE'))
df

                   A         B         C         D         E
2013-01-01 -1.877612 -0.082086 -1.153945 -0.943746  2.254446
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148  0.678031
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345
2013-01-04 -0.099040  1.644901 -1.588726  0.809771 -1.213540
2013-01-05 -0.745528  0.366749 -1.318339  0.924763  0.636053

In [17]:
df2 = pd.DataFrame({ 'A' : 1.,
    'B' : pd.Timestamp('20130102'),
  'C' : pd.Series(2,index=list(range(4)),dtype='float32'),
  'D' : np.array([3] * 4,dtype='int32'),
   'E' : pd.Categorical(["test","train","test","train"]),
    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  2.0  3   test  foo
1  1.0 2013-01-02  2.0  3  train  foo
2  1.0 2013-01-02  2.0  3   test  foo
3  1.0 2013-01-02  2.0  3  train  foo

In [18]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [19]:
df.head(3)

                   A         B         C         D         E
2013-01-01 -1.877612 -0.082086 -1.153945 -0.943746  2.254446
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148  0.678031
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345

In [20]:
df.tail(3)

                   A         B         C         D         E
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345
2013-01-04 -0.099040  1.644901 -1.588726  0.809771 -1.213540
2013-01-05 -0.745528  0.366749 -1.318339  0.924763  0.636053

In [21]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [23]:
df.values

array([[-1.87761216, -0.08208595, -1.15394454, -0.94374606,  2.25444609],
       [-1.58189044, -0.56369581, -0.63289829, -1.17514836,  0.67803066],
       [ 0.44963731, -0.79284401,  1.43307311,  1.10526905,  0.1133455 ],
       [-0.09903964,  1.64490051, -1.58872612,  0.80977137, -1.2135402 ],
       [-0.74552839,  0.36674933, -1.31833853,  0.92476288,  0.63605299]])

In [24]:
df.describe()

              A         B         C         D         E
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean  -0.770887  0.114605 -0.652167  0.144182  0.493667
std    0.977787  0.965353  1.216687  1.106822  1.246376
min   -1.877612 -0.792844 -1.588726 -1.175148 -1.213540
25%   -1.581890 -0.563696 -1.318339 -0.943746  0.113345
50%   -0.745528 -0.082086 -1.153945  0.809771  0.636053
75%   -0.099040  0.366749 -0.632898  0.924763  0.678031
max    0.449637  1.644901  1.433073  1.105269  2.254446

In [25]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05
A   -1.877612   -1.581890    0.449637   -0.099040   -0.745528
B   -0.082086   -0.563696   -0.792844    1.644901    0.366749
C   -1.153945   -0.632898    1.433073   -1.588726   -1.318339
D   -0.943746   -1.175148    1.105269    0.809771    0.924763
E    2.254446    0.678031    0.113345   -1.213540    0.636053

In [29]:
df.sort_index(axis=1, ascending=False)

                   E         D         C         B         A
2013-01-01  2.254446 -0.943746 -1.153945 -0.082086 -1.877612
2013-01-02  0.678031 -1.175148 -0.632898 -0.563696 -1.581890
2013-01-03  0.113345  1.105269  1.433073 -0.792844  0.449637
2013-01-04 -1.213540  0.809771 -1.588726  1.644901 -0.099040
2013-01-05  0.636053  0.924763 -1.318339  0.366749 -0.745528

In [28]:
df.sort_values(by='B')

                   A         B         C         D         E
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148  0.678031
2013-01-01 -1.877612 -0.082086 -1.153945 -0.943746  2.254446
2013-01-05 -0.745528  0.366749 -1.318339  0.924763  0.636053
2013-01-04 -0.099040  1.644901 -1.588726  0.809771 -1.213540

# Selection
Note While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.
See the indexing documentation Indexing and Selecting Data and MultiIndex / Advanced Indexing

In [32]:
df['A']

2013-01-01   -1.877612
2013-01-02   -1.581890
2013-01-03    0.449637
2013-01-04   -0.099040
2013-01-05   -0.745528
Freq: D, Name: A, dtype: float64

In [33]:
df[0:3]

                   A         B         C         D         E
2013-01-01 -1.877612 -0.082086 -1.153945 -0.943746  2.254446
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148  0.678031
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345

In [34]:
df['20130102':'20130104']

                   A         B         C         D         E
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148  0.678031
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345
2013-01-04 -0.099040  1.644901 -1.588726  0.809771 -1.213540

In [35]:
df.loc[dates[0]]

A   -1.877612
B   -0.082086
C   -1.153945
D   -0.943746
E    2.254446
Name: 2013-01-01 00:00:00, dtype: float64

In [36]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.877612 -0.082086
2013-01-02 -1.581890 -0.563696
2013-01-03  0.449637 -0.792844
2013-01-04 -0.099040  1.644901
2013-01-05 -0.745528  0.366749

In [37]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.581890 -0.563696
2013-01-03  0.449637 -0.792844
2013-01-04 -0.099040  1.644901

In [38]:
df.loc['20130102',['A','B']]

A   -1.581890
B   -0.563696
Name: 2013-01-02 00:00:00, dtype: float64

In [41]:
df.loc[dates[0],'A']

-1.877612158303041

In [42]:
df.at[dates[0],'A']

-1.877612158303041

In [43]:
df.iloc[3]

A   -0.099040
B    1.644901
C   -1.588726
D    0.809771
E   -1.213540
Name: 2013-01-04 00:00:00, dtype: float64

In [44]:
 df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.099040  1.644901
2013-01-05 -0.745528  0.366749

In [45]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.581890 -0.632898
2013-01-03  0.449637  1.433073
2013-01-05 -0.745528 -1.318339

In [46]:
df.iloc[1:3,:]

                   A         B         C         D         E
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148  0.678031
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345

In [47]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.082086 -1.153945
2013-01-02 -0.563696 -0.632898
2013-01-03 -0.792844  1.433073
2013-01-04  1.644901 -1.588726
2013-01-05  0.366749 -1.318339

In [48]:
df.iloc[1,1]

-0.56369581062510044

In [49]:
df.iat[1,1]

-0.56369581062510044

In [50]:
df[df.A > 0]

                   A         B         C         D         E
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345

In [51]:
df[df > 0]

                   A         B         C         D         E
2013-01-01       NaN       NaN       NaN       NaN  2.254446
2013-01-02       NaN       NaN       NaN       NaN  0.678031
2013-01-03  0.449637       NaN  1.433073  1.105269  0.113345
2013-01-04       NaN  1.644901       NaN  0.809771       NaN
2013-01-05       NaN  0.366749       NaN  0.924763  0.636053

In [54]:
df2 = df.copy()
df2['E'] = ['one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -1.877612 -0.082086 -1.153945 -0.943746    one
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148    two
2013-01-03  0.449637 -0.792844  1.433073  1.105269  three
2013-01-04 -0.099040  1.644901 -1.588726  0.809771   four
2013-01-05 -0.745528  0.366749 -1.318339  0.924763  three

In [55]:
df2[df2['E'].isin(['two','four'])]

                  A         B         C         D     E
2013-01-02 -1.58189 -0.563696 -0.632898 -1.175148   two
2013-01-04 -0.09904  1.644901 -1.588726  0.809771  four

# Setting
Setting a new column automatically aligns the data by the indexes

In [59]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [61]:
df['F'] = s1
df

                   A         B         C         D         E    F
2013-01-01 -1.877612 -0.082086 -1.153945 -0.943746  2.254446  NaN
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148  0.678031  1.0
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345  2.0
2013-01-04 -0.099040  1.644901 -1.588726  0.809771 -1.213540  3.0
2013-01-05 -0.745528  0.366749 -1.318339  0.924763  0.636053  4.0

In [63]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D         E    F
2013-01-01  0.000000 -0.082086 -1.153945 -0.943746  2.254446  NaN
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148  0.678031  1.0
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345  2.0
2013-01-04 -0.099040  1.644901 -1.588726  0.809771 -1.213540  3.0
2013-01-05 -0.745528  0.366749 -1.318339  0.924763  0.636053  4.0

In [64]:
df.iat[0,1] = 0
df

                   A         B         C         D         E    F
2013-01-01  0.000000  0.000000 -1.153945 -0.943746  2.254446  NaN
2013-01-02 -1.581890 -0.563696 -0.632898 -1.175148  0.678031  1.0
2013-01-03  0.449637 -0.792844  1.433073  1.105269  0.113345  2.0
2013-01-04 -0.099040  1.644901 -1.588726  0.809771 -1.213540  3.0
2013-01-05 -0.745528  0.366749 -1.318339  0.924763  0.636053  4.0

In [65]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D         E    F
2013-01-01  0.000000  0.000000 -1.153945  5  2.254446  NaN
2013-01-02 -1.581890 -0.563696 -0.632898  5  0.678031  1.0
2013-01-03  0.449637 -0.792844  1.433073  5  0.113345  2.0
2013-01-04 -0.099040  1.644901 -1.588726  5 -1.213540  3.0
2013-01-05 -0.745528  0.366749 -1.318339  5  0.636053  4.0

In [66]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D         E    F
2013-01-01  0.000000  0.000000 -1.153945 -5 -2.254446  NaN
2013-01-02 -1.581890 -0.563696 -0.632898 -5 -0.678031 -1.0
2013-01-03 -0.449637 -0.792844 -1.433073 -5 -0.113345 -2.0
2013-01-04 -0.099040 -1.644901 -1.588726 -5 -1.213540 -3.0
2013-01-05 -0.745528 -0.366749 -1.318339 -5 -0.636053 -4.0

# Missing Data
pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [67]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D         E    F         E
2013-01-01  0.000000  0.000000 -1.153945  5  2.254446  NaN  2.254446
2013-01-02 -1.581890 -0.563696 -0.632898  5  0.678031  1.0  0.678031
2013-01-03  0.449637 -0.792844  1.433073  5  0.113345  2.0  0.113345
2013-01-04 -0.099040  1.644901 -1.588726  5 -1.213540  3.0 -1.213540

In [73]:
df1.loc[dates[0]:dates[1],'E'] = np.nan
df1

                   A         B         C  D         E    F         E
2013-01-01  0.000000  0.000000 -1.153945  5       NaN  NaN       NaN
2013-01-02 -1.581890 -0.563696 -0.632898  5       NaN  1.0       NaN
2013-01-03  0.449637 -0.792844  1.433073  5  0.113345  2.0  0.113345
2013-01-04 -0.099040  1.644901 -1.588726  5 -1.213540  3.0 -1.213540

In [79]:
df1.dropna(how='any')

                   A         B         C  D         E    F         E
2013-01-03  0.449637 -0.792844  1.433073  5  0.113345  2.0  0.113345
2013-01-04 -0.099040  1.644901 -1.588726  5 -1.213540  3.0 -1.213540

In [78]:
df1.fillna(value=9)

                   A         B         C  D         E    F         E
2013-01-01  0.000000  0.000000 -1.153945  5  9.000000  9.0  9.000000
2013-01-02 -1.581890 -0.563696 -0.632898  5  9.000000  1.0  9.000000
2013-01-03  0.449637 -0.792844  1.433073  5  0.113345  2.0  0.113345
2013-01-04 -0.099040  1.644901 -1.588726  5 -1.213540  3.0 -1.213540

In [77]:
pd.isnull(df1)

                A      B      C      D      E      F      E
2013-01-01  False  False  False  False   True   True   True
2013-01-02  False  False  False  False   True  False   True
2013-01-03  False  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False  False

# Operations
See the Basic section on Binary Ops

In [83]:
df

                   A         B         C  D         E    F
2013-01-01  0.000000  0.000000 -1.153945  5  2.254446  NaN
2013-01-02 -1.581890 -0.563696 -0.632898  5  0.678031  1.0
2013-01-03  0.449637 -0.792844  1.433073  5  0.113345  2.0
2013-01-04 -0.099040  1.644901 -1.588726  5 -1.213540  3.0
2013-01-05 -0.745528  0.366749 -1.318339  5  0.636053  4.0

In [80]:
df.mean()

A   -0.395364
B    0.131022
C   -0.652167
D    5.000000
E    0.493667
F    2.500000
dtype: float64

In [81]:
df.mean(1)

2013-01-01    1.220100
2013-01-02    0.649924
2013-01-03    1.367202
2013-01-04    1.123932
2013-01-05    1.323156
Freq: D, dtype: float64

In [87]:
s = pd.Series([1,3,5,np.nan,6], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
Freq: D, dtype: float64

In [88]:
df.sub(s, axis='index')
df

                   A         B         C  D         E    F
2013-01-01  0.000000  0.000000 -1.153945  5  2.254446  NaN
2013-01-02 -1.581890 -0.563696 -0.632898  5  0.678031  1.0
2013-01-03  0.449637 -0.792844  1.433073  5  0.113345  2.0
2013-01-04 -0.099040  1.644901 -1.588726  5 -1.213540  3.0
2013-01-05 -0.745528  0.366749 -1.318339  5  0.636053  4.0

# Apply

Applying functions to the data

In [89]:
df.apply(np.cumsum)

                   A         B         C   D         E     F
2013-01-01  0.000000  0.000000 -1.153945   5  2.254446   NaN
2013-01-02 -1.581890 -0.563696 -1.786843  10  2.932477   1.0
2013-01-03 -1.132253 -1.356540 -0.353770  15  3.045822   3.0
2013-01-04 -1.231293  0.288361 -1.942496  20  1.832282   6.0
2013-01-05 -1.976821  0.655110 -3.260834  25  2.468335  10.0

In [90]:
df.apply(lambda x: x.max() - x.min())

A    2.031528
B    2.437745
C    3.021799
D    0.000000
E    3.467986
F    3.000000
dtype: float64

# Histogramming

See more at Histogramming and Discretization

In [97]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    2
2    3
3    2
4    4
5    3
6    1
7    2
8    5
9    4
dtype: int32

In [98]:
s.value_counts()

2    3
4    2
3    2
6    1
5    1
1    1
dtype: int64

# String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses regular expressions by default (and in some cases always uses them). See more at Vectorized String Methods.

In [100]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [102]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [107]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.884249  1.535361  1.194379  2.748417
1 -1.206393 -0.246296  0.211834  0.165490
2 -1.997072 -0.366021 -0.406823 -0.846058
3 -0.247851  0.112660 -1.612850  0.166828
4  0.746053  0.122898  0.968834 -0.449507
5  0.572261 -1.345987 -0.217997  0.149663
6 -1.519386  0.819046  1.063496 -0.781159
7 -0.621237  0.752412 -0.590308 -1.445035
8 -0.330809 -0.314118 -0.354345  2.897718
9  1.380773  0.173259  0.604850 -0.252747

In [109]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.884249  1.535361  1.194379  2.748417
 1 -1.206393 -0.246296  0.211834  0.165490
 2 -1.997072 -0.366021 -0.406823 -0.846058,
           0         1         2         3
 3 -0.247851  0.112660 -1.612850  0.166828
 4  0.746053  0.122898  0.968834 -0.449507
 5  0.572261 -1.345987 -0.217997  0.149663
 6 -1.519386  0.819046  1.063496 -0.781159,
           0         1         2         3
 7 -0.621237  0.752412 -0.590308 -1.445035
 8 -0.330809 -0.314118 -0.354345  2.897718
 9  1.380773  0.173259  0.604850 -0.252747]

In [110]:
pd.concat(pieces)

          0         1         2         3
0  0.884249  1.535361  1.194379  2.748417
1 -1.206393 -0.246296  0.211834  0.165490
2 -1.997072 -0.366021 -0.406823 -0.846058
3 -0.247851  0.112660 -1.612850  0.166828
4  0.746053  0.122898  0.968834 -0.449507
5  0.572261 -1.345987 -0.217997  0.149663
6 -1.519386  0.819046  1.063496 -0.781159
7 -0.621237  0.752412 -0.590308 -1.445035
8 -0.330809 -0.314118 -0.354345  2.897718
9  1.380773  0.173259  0.604850 -0.252747

In [118]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [119]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [120]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [122]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.170800 -1.193008 -0.713758 -0.156732
1 -1.647198 -0.617478 -0.410575  0.710404
2 -2.272927 -0.139043  0.853373  0.992141
3 -0.251366 -1.243122 -0.428009  0.900241
4  0.543239 -0.433888  0.916208 -0.950441
5 -0.500975 -1.217558  0.532467 -1.171525
6 -1.930372 -0.528511 -0.394492 -0.311297
7 -1.299728  1.671921  0.106490 -0.740524

In [124]:
s = df.iloc[3]
s

A   -0.251366
B   -1.243122
C   -0.428009
D    0.900241
Name: 3, dtype: float64

In [125]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.170800 -1.193008 -0.713758 -0.156732
1 -1.647198 -0.617478 -0.410575  0.710404
2 -2.272927 -0.139043  0.853373  0.992141
3 -0.251366 -1.243122 -0.428009  0.900241
4  0.543239 -0.433888  0.916208 -0.950441
5 -0.500975 -1.217558  0.532467 -1.171525
6 -1.930372 -0.528511 -0.394492 -0.311297
7 -1.299728  1.671921  0.106490 -0.740524
8 -0.251366 -1.243122 -0.428009  0.900241

# Grouping
By “group by” we are referring to a process involving one or more of the following steps

* Splitting the data into groups based on some criteria
* Applying a function to each group independently
* Combining the results into a data structure

In [127]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.269622 -0.835182
1  bar    one  1.474814  0.614662
2  foo    two  1.058672  1.637751
3  bar  three -0.238420  1.294605
4  foo    two -0.267154 -0.683905
5  bar    two -0.140274 -1.027281
6  foo    one -2.275554  0.381899
7  foo  three  0.250677 -0.981831

In [131]:
df.groupby('A').sum()

            C         D
A
bar  1.096120  0.881986
foo -0.963738 -0.481268

In [133]:
df.groupby(['B','A']).sum()

                  C         D
B     A
one   bar  1.474814  0.614662
      foo -2.005932 -0.453283
three bar -0.238420  1.294605
      foo  0.250677 -0.981831
two   bar -0.140274 -1.027281
      foo  0.791518  0.953846

# Reshaping
See the sections on Hierarchical Indexing and Reshaping.

In [136]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [138]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [139]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one     1.089005  1.549505
      two     0.702474  1.430239
baz   one    -1.312527  0.059830
      two     0.933741  0.591516
foo   one    -0.427903 -1.024946
      two    -0.147598 -0.532139
qux   one    -0.547107 -0.930312
      two     0.038529 -0.298697

In [140]:
df2 = df[:4]
df2

                     A         B
first second
bar   one     1.089005  1.549505
      two     0.702474  1.430239
baz   one    -1.312527  0.059830
      two     0.933741  0.591516

In [141]:
stacked = df2.stack()
stacked

first  second
bar    one     A    1.089005
               B    1.549505
       two     A    0.702474
               B    1.430239
baz    one     A   -1.312527
               B    0.059830
       two     A    0.933741
               B    0.591516
dtype: float64

In [142]:
stacked.unstack()

                     A         B
first second
bar   one     1.089005  1.549505
      two     0.702474  1.430239
baz   one    -1.312527  0.059830
      two     0.933741  0.591516

In [143]:
stacked.unstack(1)

second        one       two
first
bar   A  1.089005  0.702474
      B  1.549505  1.430239
baz   A -1.312527  0.933741
      B  0.059830  0.591516

In [144]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.089005 -1.312527
       B  1.549505  0.059830
two    A  0.702474  0.933741
       B  1.430239  0.591516

In [146]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -2.214394  0.706079
1     one  B  foo  0.246510  0.671572
2     two  C  foo -0.953134  0.603405
3   three  A  bar -0.238855 -0.289804
4     one  B  bar -0.499107  0.545128
5     one  C  bar  0.466999  0.428121
6     two  A  foo  0.711961  0.743408
7   three  B  foo  0.382747 -0.866156
8     one  C  foo -0.597696  0.754196
9     one  A  bar -0.756290 -0.228980
10    two  B  bar  0.494539 -1.066668
11  three  C  bar  1.403969 -0.296048

In [147]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.756290 -2.214394
      B -0.499107  0.246510
      C  0.466999 -0.597696
three A -0.238855       NaN
      B       NaN  0.382747
      C  1.403969       NaN
two   A       NaN  0.711961
      B  0.494539       NaN
      C       NaN -0.953134

# Time Series
pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the Time Series section

In [149]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [150]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2012-01-01 00:00:00    434
2012-01-01 00:00:01    337
2012-01-01 00:00:02    495
2012-01-01 00:00:03    300
2012-01-01 00:00:04    127
2012-01-01 00:00:05    491
2012-01-01 00:00:06    298
2012-01-01 00:00:07    370
2012-01-01 00:00:08     29
2012-01-01 00:00:09    267
2012-01-01 00:00:10    323
2012-01-01 00:00:11    490
2012-01-01 00:00:12    417
2012-01-01 00:00:13     38
2012-01-01 00:00:14    359
2012-01-01 00:00:15     96
2012-01-01 00:00:16    151
2012-01-01 00:00:17    258
2012-01-01 00:00:18     35
2012-01-01 00:00:19     83
2012-01-01 00:00:20      5
2012-01-01 00:00:21    458
2012-01-01 00:00:22    478
2012-01-01 00:00:23    164
2012-01-01 00:00:24    287
2012-01-01 00:00:25    336
2012-01-01 00:00:26    257
2012-01-01 00:00:27    433
2012-01-01 00:00:28     20
2012-01-01 00:00:29    233
                      ...
2012-01-01 00:01:10    222
2012-01-01 00:01:11     46
2012-01-01 00:01:12     96
2012-01-01 00:01:13     32
2012-01-01 00:01:14    305
2012-01-01 00:01:15    245
2012-01-01 00:01:16    339
2012-01-01 00:01:17    196
2012-01-01 00:01:18    486
2012-01-01 00:01:19    173
2012-01-01 00:01:20    186
2012-01-01 00:01:21     82
2012-01-01 00:01:22    490
2012-01-01 00:01:23    401
2012-01-01 00:01:24    150
2012-01-01 00:01:25     11
2012-01-01 00:01:26    263
2012-01-01 00:01:27     51
2012-01-01 00:01:28    192
2012-01-01 00:01:29    107
2012-01-01 00:01:30    100
2012-01-01 00:01:31    264
2012-01-01 00:01:32     21
2012-01-01 00:01:33    111
2012-01-01 00:01:34    333
2012-01-01 00:01:35    101
2012-01-01 00:01:36    170
2012-01-01 00:01:37    220
2012-01-01 00:01:38    215
2012-01-01 00:01:39    463
Freq: S, dtype: int32

In [152]:
ts.resample('1Min').sum()

2012-01-01 00:00:00    16391
2012-01-01 00:01:00     8552
Freq: T, dtype: int32

In [153]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [154]:
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    1.446287
2012-03-07    0.370868
2012-03-08   -1.702481
2012-03-09    1.295265
2012-03-10    1.668949
Freq: D, dtype: float64

In [156]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    1.446287
2012-03-07 00:00:00+00:00    0.370868
2012-03-08 00:00:00+00:00   -1.702481
2012-03-09 00:00:00+00:00    1.295265
2012-03-10 00:00:00+00:00    1.668949
Freq: D, dtype: float64

In [157]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    1.446287
2012-03-06 19:00:00-05:00    0.370868
2012-03-07 19:00:00-05:00   -1.702481
2012-03-08 19:00:00-05:00    1.295265
2012-03-09 19:00:00-05:00    1.668949
Freq: D, dtype: float64

In [158]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
rng

DatetimeIndex(['2012-01-31', '2012-02-29', '2012-03-31', '2012-04-30',
               '2012-05-31'],
              dtype='datetime64[ns]', freq='M')

In [159]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -0.135664
2012-02-29   -0.565024
2012-03-31    0.167479
2012-04-30   -2.495234
2012-05-31    0.803681
Freq: M, dtype: float64

In [160]:
ps = ts.to_period()
ps

2012-01   -0.135664
2012-02   -0.565024
2012-03    0.167479
2012-04   -2.495234
2012-05    0.803681
Freq: M, dtype: float64

In [161]:
ps.to_timestamp()

2012-01-01   -0.135664
2012-02-01   -0.565024
2012-03-01    0.167479
2012-04-01   -2.495234
2012-05-01    0.803681
Freq: MS, dtype: float64

In [163]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='int64', freq='Q-NOV')

In [164]:
ts = pd.Series(np.random.randn(len(prng)), prng)
ts

1990Q1    0.226079
1990Q2    0.964069
1990Q3    0.952437
1990Q4   -0.617615
1991Q1    1.227645
1991Q2   -0.787633
1991Q3    2.947940
1991Q4    1.018389
1992Q1    0.568997
1992Q2    0.775090
1992Q3   -0.093655
1992Q4    0.332737
1993Q1    0.200066
1993Q2    0.355003
1993Q3    0.940852
1993Q4   -2.136988
1994Q1   -0.381484
1994Q2    0.026650
1994Q3   -0.814713
1994Q4   -0.566686
1995Q1   -1.316952
1995Q2   -1.170957
1995Q3    0.486433
1995Q4   -1.240045
1996Q1    0.546588
1996Q2    0.128970
1996Q3   -1.192423
1996Q4    0.753692
1997Q1   -0.133478
1997Q2    0.249926
1997Q3   -0.598693
1997Q4    0.566736
1998Q1    0.073898
1998Q2    2.755603
1998Q3    1.184328
1998Q4   -0.516453
1999Q1    1.391715
1999Q2   -0.125416
1999Q3    0.384873
1999Q4   -1.724302
2000Q1    0.726966
2000Q2    1.742048
2000Q3   -0.032521
2000Q4    2.266802
Freq: Q-NOV, dtype: float64

In [166]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.index

PeriodIndex(['1990-03-01 09:00', '1990-06-01 09:00', '1990-09-01 09:00',
             '1990-12-01 09:00', '1991-03-01 09:00', '1991-06-01 09:00',
             '1991-09-01 09:00', '1991-12-01 09:00', '1992-03-01 09:00',
             '1992-06-01 09:00', '1992-09-01 09:00', '1992-12-01 09:00',
             '1993-03-01 09:00', '1993-06-01 09:00', '1993-09-01 09:00',
             '1993-12-01 09:00', '1994-03-01 09:00', '1994-06-01 09:00',
             '1994-09-01 09:00', '1994-12-01 09:00', '1995-03-01 09:00',
             '1995-06-01 09:00', '1995-09-01 09:00', '1995-12-01 09:00',
             '1996-03-01 09:00', '1996-06-01 09:00', '1996-09-01 09:00',
             '1996-12-01 09:00', '1997-03-01 09:00', '1997-06-01 09:00',
             '1997-09-01 09:00', '1997-12-01 09:00', '1998-03-01 09:00',
             '1998-06-01 09:00', '1998-09-01 09:00', '1998-12-01 09:00',
             '1999-03-01 09:00', '1999-06-01 09:00', '1999-09-01 09:00',
             '1999-12-01 09:00', '2000-03-01 09:00', '2000-06-01 09:00',
             '2000-09-01 09:00', '2000-12-01 09:00'],
            dtype='int64', freq='H')

In [167]:
ts.head()

1990-03-01 09:00    0.226079
1990-06-01 09:00    0.964069
1990-09-01 09:00    0.952437
1990-12-01 09:00   -0.617615
1991-03-01 09:00    1.227645
Freq: H, dtype: float64